## 作業

In [1]:
import requests
res = requests.get('https://news.ltn.com.tw/list/breakingnews')
res

In [3]:
#res.text

In [4]:
from bs4 import BeautifulSoup
soup = BeautifulSoup(res.text, 'lxml')

In [6]:
#soup

In [16]:
for li in soup.select('.list li'):
  #print(li)
  title = li.select_one('span.title').text
  dt = li.select_one('.time').text
  link = li.select_one('a.tit').get('href')
  print(title, dt, link)
  print('======================================')

剪接影片造假談話 CNN：拜登用假廣告攻擊川普 09:34 https://news.ltn.com.tw/news/world/breakingnews/3296734
======================================
9/19重要財經新聞一覽 09:32 https://ec.ltn.com.tw/article/breakingnews/3296759
======================================
米奇米妮萌助陣！這檔購物節超划算 3000現抵300特惠組最低46折 09:30 https://ent.ltn.com.tw/news/breakingnews/3296637
======================================
安倍參拜靖國神社 報告已卸下首相職務 09:29 https://news.ltn.com.tw/news/world/breakingnews/3296750
======================================
追思李登輝》蔡總統親頒褒揚令 追思文感念「把民主自由留給台灣」 09:28 https://news.ltn.com.tw/news/politics/breakingnews/3296678
======================================
追思李登輝》「三十九與九十八」 李坤儀撰文悼念祖父慈愛 09:27 https://news.ltn.com.tw/news/politics/breakingnews/3296736
======================================
NBA》詹皇僅拿16張第1名選票  湖人主帥仍力挺：他才是MVP 09:21 https://sports.ltn.com.tw/news/breakingnews/3296723
======================================
NBA》重提往事倡導精神健康 「愛神」自曝：好友救了我一命 09:20 https://sports.ltn.com.tw/news/breakingnews/3296707
======================================
意外捲入輕生事件 郭雪芙到處傻問「誰墜樓過」 09:20 https://ent.ltn.com.tw/news/breakingnews/3296654
======================================
MLB》洋基「園丁」發願再戰2021 美球迷無情狠酸：拜託不要 09:17 https://sports.ltn.com.tw/news/breakingnews/3296695
======================================
科技股下挫牽動美各大指數收黑 道瓊跌244點 09:16 https://ec.ltn.com.tw/article/breakingnews/3296681
======================================
追思李登輝》兩組民眾疑追思會場周邊抗議 警方帶至陳抗區 09:15 https://news.ltn.com.tw/news/politics/breakingnews/3296739
======================================
神車 Altis 挑戰者，新一代 Nissan Sentra 試駕報告！〈內有相片集〉 09:15 https://auto.ltn.com.tw/news/16152
======================================
追思李登輝》李坤儀手捧骨灰罈 移靈車隊由翠山莊出發 09:13 https://news.ltn.com.tw/news/politics/breakingnews/3296731
======================================
營區停車場猥褻女同袍：「妹妹，你可以幫我嗎？」 09:10 https://news.ltn.com.tw/news/society/breakingnews/3296724
======================================
「雙野CP」默契十足 綾野剛狂嗑烏龍麵直到極限 09:10 https://ent.ltn.com.tw/news/breakingnews/3296649
======================================
峮峮現身！一身黑踏入小鬼靈堂 拭淚惹鼻酸 09:06 https://ent.ltn.com.tw/news/breakingnews/3296729
======================================
申敏兒回歸大銀幕克服懼高症 登高跳水搏出名 09:00 https://ent.ltn.com.tw/news/breakingnews/3296650
======================================
日本「最美姊妹檔」票選木村家竟連前10都沒有！冠軍姊妹小六就被星探發掘 09:00 https://istyle.ltn.com.tw/article/14538
======================================
5工人喝茫聚眾鬥毆 警出齊眉棍再噴辣椒水壓制逮人 08:59 https://news.ltn.com.tw/news/society/breakingnews/3296726
======================================

In [17]:
newsary = []
for li in soup.select('.list li'):
  title = li.select_one('span.title').text
  dt = li.select_one('.time').text
  link = li.select_one('a.tit').get('href')
  newsary.append({'title':title, 'dt':dt, 'link':link})

In [18]:
newsary[0]

{'dt': '09:34',
 'link': 'https://news.ltn.com.tw/news/world/breakingnews/3296734',
 'title': '剪接影片造假談話 CNN：拜登用假廣告攻擊川普'}

In [19]:
import pandas
newsdf = pandas.DataFrame(newsary)

In [21]:
newsdf.head()

                                title  ...                                               link
0             剪接影片造假談話 CNN：拜登用假廣告攻擊川普  ...  https://news.ltn.com.tw/news/world/breakingnew...
1                        9/19重要財經新聞一覽  ...  https://ec.ltn.com.tw/article/breakingnews/329...
2  米奇米妮萌助陣！這檔購物節超划算 3000現抵300特惠組最低46折  ...   https://ent.ltn.com.tw/news/breakingnews/3296637
3                  安倍參拜靖國神社 報告已卸下首相職務  ...  https://news.ltn.com.tw/news/world/breakingnew...
4     追思李登輝》蔡總統親頒褒揚令 追思文感念「把民主自由留給台灣」  ...  https://news.ltn.com.tw/news/politics/breaking...

[5 rows x 3 columns]

In [22]:
newsdf.to_excel('ltnnews.xlsx')

## 完整自由時報爬蟲

In [25]:
import requests
res = requests.get('https://news.ltn.com.tw/ajax/breakingnews/all/2')
jd = res.json()

In [28]:
newsdf = pandas.DataFrame(jd['data'].values())

In [30]:
newsdf.head(3)

        no                      title  ... style tagText
0  3296731  追思李登輝》李坤儀手捧骨灰罈 移靈車隊由翠山莊出發  ...  None      政治
1  3296724    營區停車場猥褻女同袍：「妹妹，你可以幫我嗎？」  ...  None      社會
2  3296649    「雙野CP」默契十足 綾野剛狂嗑烏龍麵直到極限  ...  None      娛樂

[3 rows x 17 columns]

In [33]:
import requests
import time
newsdfs = []
for i in range(2,11):
  res = requests.get('https://news.ltn.com.tw/ajax/breakingnews/all/{}'.format(i))
  jd = res.json()
  newsdf = pandas.DataFrame(jd['data'].values())
  time.sleep(1)
  newsdfs.append(newsdf)

In [35]:
type(newsdfs)

list

In [37]:
type(newsdfs[0])

pandas.core.frame.DataFrame

In [39]:
res = pandas.concat(newsdfs)

In [43]:
import jieba
words = []
for title in res['title'].tolist():
  words = words + jieba.lcut(title)

Building prefix dict from the default dictionary ...
Dumping model to file cache /tmp/jieba.cache
Loading model cost 0.915 seconds.
Prefix dict has been built successfully.

In [46]:
from collections import Counter
words = [word for word in words if len(word) >=2]
c = Counter(words)
c.most_common(10)

[('中職', 12),
 ('追思', 7),
 ('12', 7),
 ('中國', 7),
 ('李登輝', 6),
 ('影音', 6),
 ('兄弟', 6),
 ('網球', 5),
 ('NBA', 5),
 ('回應', 5)]

## Concat v.s. DataFrame

In [48]:
# list of dictionaries
ary = [
 {'title':'abc', 'link':'http://abc.com'},
 {'title':'def', 'link':'http://def.com'}
]

import pandas
df = pandas.DataFrame(ary)
df

  title            link
0   abc  http://abc.com
1   def  http://def.com

In [51]:
ary1 = [
 {'title':'abc', 'link':'http://abc.com'},
 {'title':'def', 'link':'http://def.com'}
]

ary2 = [
 {'title':'abc1', 'link':'http://abc1.com'},
 {'title':'def1', 'link':'http://def1.com'}
]

In [52]:
df1 = pandas.DataFrame(ary1)
df1

  title            link
0   abc  http://abc.com
1   def  http://def.com

In [55]:

df2 = pandas.DataFrame(ary2)
df2

  title             link
0  abc1  http://abc1.com
1  def1  http://def1.com

In [56]:
# list of dataframes
pandas.concat([df1, df2])

  title             link
0   abc   http://abc.com
1   def   http://def.com
0  abc1  http://abc1.com
1  def1  http://def1.com

## Lists

In [57]:
a = [1,2,3,'hello', [4,5,6]]

In [58]:
a.append({'a':1})

In [59]:
a

[1, 2, 3, 'hello', [4, 5, 6], {'a': 1}]

In [60]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

In [62]:
for i in range(len(a)):
  #print(i)
  print(a[i] * b[i])

2
12
30
56
90

In [65]:
for i,j in zip(a,b):
  print(i*j)

2
12
30
56
90

In [66]:
a * b

TypeError: ignored

In [67]:
type(a)

list

In [68]:
import numpy as np
na = np.array(a)

In [69]:
type(na)

numpy.ndarray

In [71]:
a

[1, 3, 5, 7, 9]

In [70]:
na

array([1, 3, 5, 7, 9])

In [72]:
na = np.array(a)
nb = np.array(b)
na * nb

array([ 2, 12, 30, 56, 90])

In [75]:
import numpy as np
my_list = [1,2,3]
na_list = np.array(my_list)

In [77]:
na_list * 3

array([3, 6, 9])

In [78]:
np.sqrt(na_list)

array([1.        , 1.41421356, 1.73205081])

In [80]:
my_matrix =[[1,2,3],[4,5,6],[7,8,9]]
m = np.array(my_matrix)

In [81]:
-1 * m

array([[-1, -2, -3],
       [-4, -5, -6],
       [-7, -8, -9]])

In [82]:
np.arange(0,10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [83]:
np.arange(0,11,2)

array([ 0,  2,  4,  6,  8, 10])

In [84]:
np.zeros(3)

array([0., 0., 0.])

In [85]:
np.zeros((5,5))

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [86]:
np.ones((5,5))

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [87]:
np.random.randint(1,42,6)

array([26,  8, 20, 29,  4, 30])

In [88]:
arr = np.arange(25)

In [89]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24])

In [90]:
arr.shape

(25,)

In [91]:
arr.reshape(5,5)

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [93]:
a = np.array([70,60,43,66,82,90,53,95,88])
a.max()

95

In [94]:
a.min()

43

In [95]:
a.argmax()

7

In [96]:
a.argmin()

2

In [100]:
x = np.array([20,30,10,50,40])
w = np.random.randn(5,7)
o1 = np.dot(x,w)
w1 = np.random.randn(7,4)
o2 = np.dot(o1,w1)

In [101]:
o2

array([  97.25084349,   47.7397188 , -100.92377224,  -41.63147988])

In [102]:
arr = np.arange(0,11)

In [104]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [105]:
arr[8]

8

In [106]:
arr[1:5]

array([1, 2, 3, 4])

In [107]:
arr = np.arange(0,11)

In [108]:
slice_of_arr = arr[0:6]

In [109]:
slice_of_arr

array([0, 1, 2, 3, 4, 5])

In [110]:
slice_of_arr[:]=99

In [111]:
arr

array([99, 99, 99, 99, 99, 99,  6,  7,  8,  9, 10])

In [112]:
arr_2d = np.array(([5,10,15],[20,25,30],[35,40,45]))

In [113]:
arr_2d

array([[ 5, 10, 15],
       [20, 25, 30],
       [35, 40, 45]])

In [115]:
arr_2d[1]

array([20, 25, 30])

In [116]:
arr_2d[1][0]

20

In [117]:
arr_2d[1,0]

20

In [118]:
arr_2d[2]

array([35, 40, 45])

In [119]:
#[列,欄]
arr_2d[2,:]

array([35, 40, 45])

In [121]:
arr = np.arange(1,11)

In [122]:
arr

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [124]:
arr > 4

array([False, False, False, False,  True,  True,  True,  True,  True,
        True])

In [125]:
bool_ary = arr > 4

In [127]:
arr[bool_ary]

array([ 5,  6,  7,  8,  9, 10])

In [128]:
arr = np.arange(0,10)

In [129]:
arr + arr

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

In [130]:
arr - arr

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [131]:
arr * arr

array([ 0,  1,  4,  9, 16, 25, 36, 49, 64, 81])

In [132]:
arr / arr

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in true_divide
  """Entry point for launching an IPython kernel.

array([nan,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.])

In [ ]:
# nan => not a number, (missing value)

In [135]:
# inf => infiinity
1/arr

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: RuntimeWarning: divide by zero encountered in true_divide

array([       inf, 1.        , 0.5       , 0.33333333, 0.25      ,
       0.2       , 0.16666667, 0.14285714, 0.125     , 0.11111111])

In [134]:
arr ** 3

array([  0,   1,   8,  27,  64, 125, 216, 343, 512, 729])

In [136]:
np.sqrt(arr)

array([0.        , 1.        , 1.41421356, 1.73205081, 2.        ,
       2.23606798, 2.44948974, 2.64575131, 2.82842712, 3.        ])

In [137]:
np.exp(arr)

array([1.00000000e+00, 2.71828183e+00, 7.38905610e+00, 2.00855369e+01,
       5.45981500e+01, 1.48413159e+02, 4.03428793e+02, 1.09663316e+03,
       2.98095799e+03, 8.10308393e+03])

In [138]:
np.max(arr)

9

In [139]:
np.sin(arr)

array([ 0.        ,  0.84147098,  0.90929743,  0.14112001, -0.7568025 ,
       -0.95892427, -0.2794155 ,  0.6569866 ,  0.98935825,  0.41211849])

In [140]:
np.log(arr)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: RuntimeWarning: divide by zero encountered in log
  """Entry point for launching an IPython kernel.

array([      -inf, 0.        , 0.69314718, 1.09861229, 1.38629436,
       1.60943791, 1.79175947, 1.94591015, 2.07944154, 2.19722458])

### Practice
今天有三個學生, David, John, Mary, 她們考的兩次考試成績, 分別為 David: 90, 80,
John: 77, 65, Mary:88,95
請將這三人的考試成績表示成 2維的numpy array
(列:人, 欄: 考試次數)

今天老師給的加權分數為第一次考試為40%, 第二次考試為60%, 請利用該加權分數, 計算他們三人的最後總分?

In [141]:
import numpy as np
student_score = np.array([
  [90,  80],
  [77,  65],
  [88,  95]
])

In [142]:
student_score

array([[90, 80],
       [77, 65],
       [88, 95]])

In [143]:
student_score.shape

(3, 2)

In [146]:
student_score[:,0] * 0.4 + student_score[:,1] * 0.6

array([84. , 69.8, 92.2])

In [147]:
w =np.array([[0.4],[0.6]])
w

array([[0.4],
       [0.6]])

In [148]:
np.dot(student_score, w)

array([[84. ],
       [69.8],
       [92.2]])

In [150]:
import numpy as np
student_score = np.array([
  ['David'  ,90,  80],
  ['John'  ,77,  65],
  ['Marry'  ,88,  95]
])

In [151]:
student_score

array([['David', '90', '80'],
       ['John', '77', '65'],
       ['Marry', '88', '95']], dtype='<U5')

In [154]:
import pandas

student_score = pandas.DataFrame([
  ['David'  ,90,  80],
  ['John'  ,77,  65],
  ['Marry'  ,88,  95]
])
student_score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      object
 1   1       3 non-null      int64
 2   2       3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [156]:
student_score[1] * 0.4 + student_score[2] * 0.6

0    84.0
1    69.8
2    92.2
dtype: float64

## Pandas

In [157]:
import numpy as np
na = np.array([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M',
35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])

In [161]:
np.mean(na[:,2].astype(int))

26.833333333333332

In [162]:
import numpy as np
na = np.array([['name', 'gender', 'age'], ['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35],
['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])

In [166]:
np.mean(na[1:,2].astype(int))

26.833333333333332

In [167]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35],
['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])

In [168]:
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [169]:
df.columns=['name', 'gender', 'age']

In [170]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [172]:
df['age'].mean()

26.833333333333332

## Pandas Series

In [173]:
import numpy as np
import pandas as pd

In [174]:
labels = ['a','b','c']
my_list = [10,20,30]

In [175]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [176]:
s = pd.Series(data = my_list, index = labels)

In [177]:
s

a    10
b    20
c    30
dtype: int64

In [178]:
s[1]

20

In [179]:
s['b']

20

In [180]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [181]:
arr = np.array([10,20,30])

In [182]:
arr

array([10, 20, 30])

In [183]:
type(arr)

numpy.ndarray

In [184]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [185]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [186]:
d = {'a':10,'b':20,'c':30}

In [187]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [188]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [189]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [190]:
ser1['USA']

1

In [191]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [192]:
arr1 = pd.Series([1,2,3,4])
arr2 = pd.Series([1,2,5,4])

In [193]:
arr1 + arr2

0    2
1    4
2    8
3    8
dtype: int64

## Pandas DataFrame

In [194]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35],
['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df.columns = ['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [195]:
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted',
'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]], columns = ['name', 'gender', 'age'])

In [196]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [197]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
{'name':'mary', 'gender':'F', 'age':23}, \
{'name':'tom', 'gender':'M', 'age':35}, \
{'name':'ted', 'gender':'M', 'age':33}, \
{'name':'jean', 'gender':'F', 'age':21}, \
{'name':'lisa', 'gender':'F', 'age':20}])

In [198]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [200]:
pandas.DataFrame([[90,80],[77], [60,88]])

    0     1
0  90  80.0
1  77   NaN
2  60  88.0

In [202]:
pandas.DataFrame([
                  {'first':90,'second':80},
                  {'second':77}, 
                  {'first':60,'second':88}])

   first  second
0   90.0      80
1    NaN      77
2   60.0      88

In [203]:
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
{'name':'mary', 'gender':'F', 'age':23}, \
{'name':'tom', 'gender':'M', 'age':35}, \
{'name':'ted', 'gender':'M', 'age':33}, \
{'name':'jean', 'gender':'F', 'age':21}, \
{'name':'lisa', 'gender':'F', 'age':20}])

In [204]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [205]:
?df.head()

In [206]:
df.head(3)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35

In [207]:
df.tail()

   name gender  age
1  mary      F   23
2   tom      M   35
3   ted      M   33
4  jean      F   21
5  lisa      F   20

In [208]:
df.tail(3)

   name gender  age
3   ted      M   33
4  jean      F   21
5  lisa      F   20

In [209]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   gender  6 non-null      object
 2   age     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [210]:
df.dtypes

name      object
gender    object
age        int64
dtype: object

In [211]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [213]:
# SELECT name, age FROM　df
df[['name', 'age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [216]:
# SELECT * FROM df WHERE gender = 'M'
df[df['gender'] == 'M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [219]:
df[(df['gender'] == 'M') & (df['age'] >=30 )]

  name gender  age
2  tom      M   35
3  ted      M   33

In [220]:
df[(df['gender'] == 'M') | (df['age'] >=30 )]

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [222]:
df['employee'] = True

In [223]:
df

    name gender  age  employee
0  frank      M   29      True
1   mary      F   23      True
2    tom      M   35      True
3    ted      M   33      True
4   jean      F   21      True
5   lisa      F   20      True

In [224]:
del df['employee']

In [225]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [226]:
df['employee'] = True

In [227]:
df

    name gender  age  employee
0  frank      M   29      True
1   mary      F   23      True
2    tom      M   35      True
3    ted      M   33      True
4   jean      F   21      True
5   lisa      F   20      True

In [228]:
?df.drop

In [231]:
# axis:0 => by index, axis:1 => by column, inplace: 立即生效
df.drop('employee', axis = 1, inplace = True)

In [232]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [233]:
df.loc[6] = {'age':20,'gender':'F','name':'qoo'}

In [234]:
df.tail()

   name gender  age
2   tom      M   35
3   ted      M   33
4  jean      F   21
5  lisa      F   20
6   qoo      F   20

In [236]:
df.drop(6, axis = 0, inplace=True)

In [237]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [241]:
df = df.append(pd.DataFrame([{'age':20,'gender':'F','name':'qoo'}]),ignore_index=True)

In [244]:
df.drop(6, axis = 0, inplace=True)

In [245]:
df['userid'] = range(101,107)

In [246]:
df

    name gender  age  userid
0  frank      M   29     101
1   mary      F   23     102
2    tom      M   35     103
3    ted      M   33     104
4   jean      F   21     105
5   lisa      F   20     106

In [247]:
df.set_index('userid', inplace=True)

In [248]:
df.head()

         name gender  age
userid
101     frank      M   29
102      mary      F   23
103       tom      M   35
104       ted      M   33
105      jean      F   21

In [249]:
df.iloc[1]

name      mary
gender       F
age         23
Name: 102, dtype: object

In [250]:
df.loc[102]

name      mary
gender       F
age         23
Name: 102, dtype: object

In [251]:
df.iloc[[1,3,5]]

        name gender  age
userid
102     mary      F   23
104      ted      M   33
106     lisa      F   20

In [252]:
df.loc[[101,103,105]]

         name gender  age
userid
101     frank      M   29
103       tom      M   35
105      jean      F   21

### Practice
請幫我從新冠肺炎資料集中挑出, 9/17/20 確診數超過100萬的國家(Country/Region)?

In [254]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')

In [256]:
df.head(3)

  Province/State Country/Region       Lat  ...  9/15/20  9/16/20  9/17/20
0            NaN    Afghanistan  33.93911  ...    38815    38855    38872
1            NaN        Albania  41.15330  ...    11672    11816    11948
2            NaN        Algeria  28.03390  ...    48734    48966    49194

[3 rows x 244 columns]